netmap.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-12-26 Tue 17:06 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Netmap Learning</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Nan Jun Jie" />
<link rel="stylesheet" type="text/css" href="css/org.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="index.html"> UP </a> | 
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Netmap Learning</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org24a1aba">Netmap Vale Behavior</a>
<ul>
<li><a href="#org8cd518b">Mac Address Learning</a>
<ul>
<li><a href="#orgade53ea">Prepare Vale</a></li>
<li><a href="#org0fa1280">Show Mac Addresses</a></li>
<li><a href="#org34f227f">Train Vale</a></li>
<li><a href="#org11c08b7">Send Packets</a></li>
</ul>
</li>
<li><a href="#org27794ee">Broadcast and Multicast</a>
<ul>
<li><a href="#org86c0ac7">Prepare Vale</a></li>
<li><a href="#orgc711c71">Send Broadcast</a></li>
<li><a href="#org5e8fe82">Send Multicast</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org74b17e2">Netmap Max Vale</a>
<ul>
<li><a href="#orga40e7c2">Value Test Script</a></li>
<li><a href="#org42dfda7">Test Vale Port Number</a></li>
<li><a href="#org7d199db">Test Vale Number</a></li>
</ul>
</li>
<li><a href="#org7ae938f">Netmap App Programming</a>
<ul>
<li><a href="#org669a263">Netmap APIs</a></li>
<li><a href="#org1caa3ba">Sample: Nmpingd</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
<a href="http://info.iet.unipi.it/~luigi/netmap">Netmap</a> is a framework for very fast packet I/O from userspace.
</p>

<div id="outline-container-org24a1aba" class="outline-2">
<h2 id="org24a1aba">Netmap Vale Behavior</h2>
<div class="outline-text-2" id="text-org24a1aba">
<p>
Netmap vale is a high performance switch. It learns MAC addresses
from ether source header. Ether header format:
</p>
<div class="org-src-container">
<pre class="src src-artist">+---------------------------------+
| Destination | Source  | Type    |
| 6 Bytes     | 6 Bytes | 2 Bytes |
+---------------------------------+
</pre>
</div>

<p>
There are 3 Types of MAC address:
</p>
<ol class="org-ol">
<li><p>
Broadcast
</p>

<p>
The only one: <code>ff:ff:ff:ff:ff:ff</code>
</p></li>
<li><p>
Multicast
</p>

<p>
like <code>?x:??:??:??:??:??</code>, here x=1,3,5,7,9,b,d,f
</p></li>
<li><p>
Unicast
</p>

<p>
like <code>?x:??:??:??:??:??</code>, here x=0,2,4,6,8,a,c,e
</p></li>
</ol>

<p>
Vale switch forwards packets to all ports(except the one to send the
packets) if the destination MAC address is type of:
</p>
<ol class="org-ol">
<li>Broadcast,</li>
<li>Multicast,</li>
<li>Unicast but the mac addresses is not in the vale switch or is not
learned by the vale switch.</li>
</ol>

<p>
If the destination MAC address is unicast type and the MAC address
is learned by value, vale forwards packets to the port with the mac
address.
</p>
</div>
<div id="outline-container-org8cd518b" class="outline-3">
<h3 id="org8cd518b">Mac Address Learning</h3>
<div class="outline-text-3" id="text-org8cd518b">
</div>
<div id="outline-container-orgade53ea" class="outline-4">
<h4 id="orgade53ea">Prepare Vale</h4>
<div class="outline-text-4" id="text-orgade53ea">
<div class="org-src-container">
<pre class="src src-sh">vale-ctl -n vi0
vale-ctl -n vi1
vale-ctl -n vi2
vale-ctl -a vale0:vi0
vale-ctl -a vale0:vi1
vale-ctl -a vale0:vi2
</pre>
</div>
</div>
</div>

<div id="outline-container-org0fa1280" class="outline-4">
<h4 id="org0fa1280">Show Mac Addresses</h4>
<div class="outline-text-4" id="text-org0fa1280">
<pre class="example">
ip link #=&gt;
65742: vi0: &lt;BROADCAST,MULTICAST&gt; mtu 1500 qdisc ...
    link/ether 52:ec:30:31:bd:6c brd ff:ff:ff:ff:ff:ff
65743: vi1: &lt;BROADCAST,MULTICAST&gt; mtu 1500 qdisc ...
    link/ether b6:07:df:ed:04:86 brd ff:ff:ff:ff:ff:ff
65744: vi2: &lt;BROADCAST,MULTICAST&gt; mtu 1500 qdisc ...
    link/ether 42:d2:0e:93:c8:1b brd ff:ff:ff:ff:ff:ff
</pre>
<p>
Please notic vale does not respect the mac addresses of <code>ip link</code>
show.
</p>
</div>
</div>
<div id="outline-container-org34f227f" class="outline-4">
<h4 id="org34f227f">Train Vale</h4>
<div class="outline-text-4" id="text-org34f227f">
<p>
Vale learns mac address from ether source header, so train it like
below:
</p>
<div class="org-src-container">
<pre class="src src-sh">pkt-gen -i vale0:vi0 -S 52:ec:30:31:bd:6c -f tx
pkt-gen -i vale0:vi1 -S b6:07:df:ed:04:86 -f tx
pkt-gen -i vale0:vi2 -S 42:d2:0e:93:c8:1b -f tx
</pre>
</div>
</div>
</div>

<div id="outline-container-org11c08b7" class="outline-4">
<h4 id="org11c08b7">Send Packets</h4>
<div class="outline-text-4" id="text-org11c08b7">
<p>
Send packages from <code>vi0</code> to <code>vi1</code>:
</p>
<div class="org-src-container">
<pre class="src src-sh">pkt-gen -i vale0:vi0 -S 52:ec:30:31:bd:6c -D b6:07:df:ed:04:86 -f tx
</pre>
</div>

<p>
<code>vi1</code> should receive the packets:
</p>
<div class="org-src-container">
<pre class="src src-sh">pkt-gen -i vale0:vi1 -f rx
</pre>
</div>

<p>
<code>vi2</code> should not receive the packets:
</p>
<div class="org-src-container">
<pre class="src src-sh">pkt-gen -i vale0:vi2 -f rx
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org27794ee" class="outline-3">
<h3 id="org27794ee">Broadcast and Multicast</h3>
<div class="outline-text-3" id="text-org27794ee">
</div>
<div id="outline-container-org86c0ac7" class="outline-4">
<h4 id="org86c0ac7">Prepare Vale</h4>
<div class="outline-text-4" id="text-org86c0ac7">
<div class="org-src-container">
<pre class="src src-sh">vale-ctl -n v1p1
vale-ctl -n v1p2
vale-ctl -n v1p3
vale-ctl -a vale1:v1p1
vale-ctl -a vale1:v1p2
vale-ctl -a vale1:v1p3
pkt-gen -i vale1:v1p1 -S 51:ec:30:31:bd:6c -f tx
pkt-gen -i vale1:v1p2 -S b3:07:df:ed:04:86 -f tx
pkt-gen -i vale1:v1p3 -S 45:d2:0e:93:c8:1b -f tx
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc711c71" class="outline-4">
<h4 id="orgc711c71">Send Broadcast</h4>
<div class="outline-text-4" id="text-orgc711c71">
<div class="org-src-container">
<pre class="src src-sh">pkt-gen -i vale1:v1p1 -D ff:ff:ff:ff:ff:ff -f tx
</pre>
</div>

<p>
The broadcast traffic can be received by all vale ports:
</p>
<div class="org-src-container">
<pre class="src src-sh">pkt-gen -i vale1:v1p3 -f rx -X
</pre>
</div>
</div>
</div>
<div id="outline-container-org5e8fe82" class="outline-4">
<h4 id="org5e8fe82">Send Multicast</h4>
<div class="outline-text-4" id="text-org5e8fe82">
<div class="org-src-container">
<pre class="src src-sh">pkt-gen -i vale1:v1p1 -S 51:ec:30:31:bd:6c -D b3:07:df:ed:04:86 -f tx
</pre>
</div>

<p>
The multicast traffic can be received by all vale ports:
</p>
<div class="org-src-container">
<pre class="src src-sh">pkt-gen -i vale1:v1p3 -f rx -X
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org74b17e2" class="outline-2">
<h2 id="org74b17e2">Netmap Max Vale</h2>
<div class="outline-text-2" id="text-org74b17e2">
<p>
The default vale max number is 8. In one vale, the max port number
is 254.
</p>
</div>

<div id="outline-container-orga40e7c2" class="outline-3">
<h3 id="orga40e7c2">Value Test Script</h3>
<div class="outline-text-3" id="text-orga40e7c2">
<p>
<code>vale-test</code>:
</p>
<div class="org-src-container">
<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">!/bin/</span><span class="org-keyword">bash</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">file: vale-test</span>
<span class="org-variable-name">action</span>=${<span class="org-variable-name">1</span>:-attach}
<span class="org-builtin">shift</span>
<span class="org-variable-name">vmax</span>=${<span class="org-variable-name">1</span>:-1}
<span class="org-builtin">shift</span>
<span class="org-variable-name">pmax</span>=${<span class="org-variable-name">1</span>:-252}
<span class="org-builtin">shift</span>
<span class="org-keyword">for</span> ((<span class="org-variable-name">j</span>=0; j&lt;$<span class="org-variable-name">vmax</span>; j++)); <span class="org-keyword">do</span>
    <span class="org-keyword">for</span> ((<span class="org-variable-name">i</span>=0; i&lt;$<span class="org-variable-name">pmax</span>; i++)); <span class="org-keyword">do</span>
        <span class="org-variable-name">p</span>=$(<span class="org-sh-quoted-exec">printf</span> <span class="org-string">"p%03d%03d"</span> $<span class="org-variable-name">j</span> $<span class="org-variable-name">i</span>)
        <span class="org-variable-name">v</span>=$(<span class="org-sh-quoted-exec">printf</span> <span class="org-string">"vale%03d"</span> $<span class="org-variable-name">j</span>)
        <span class="org-builtin">echo</span> $<span class="org-variable-name">v</span>:$<span class="org-variable-name">p</span>
        <span class="org-keyword">if</span> [ <span class="org-string">"$action"</span> = <span class="org-string">"attach"</span> ]; <span class="org-keyword">then</span>
            vale-ctl -n $<span class="org-variable-name">p</span>
            vale-ctl -a $<span class="org-variable-name">v</span>:$<span class="org-variable-name">p</span>
        <span class="org-keyword">else</span>
            vale-ctl -d $<span class="org-variable-name">v</span>:$<span class="org-variable-name">p</span>
            vale-ctl -r $<span class="org-variable-name">p</span>
        <span class="org-keyword">fi</span>
    <span class="org-keyword">done</span>
<span class="org-keyword">done</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org42dfda7" class="outline-3">
<h3 id="org42dfda7">Test Vale Port Number</h3>
<div class="outline-text-3" id="text-org42dfda7">
<p>
Attach 254 ports in 1 vale:
</p>
<div class="org-src-container">
<pre class="src src-sh">vale-test attach 1 254
</pre>
</div>

<p>
Detach them:
</p>

<div class="org-src-container">
<pre class="src src-sh">vale-test detach 1 254
</pre>
</div>
</div>
</div>

<div id="outline-container-org7d199db" class="outline-3">
<h3 id="org7d199db">Test Vale Number</h3>
<div class="outline-text-3" id="text-org7d199db">
<p>
Create 8 ports and attach 1 port for each:
</p>
<div class="org-src-container">
<pre class="src src-sh">vale-test attach 8 1
</pre>
</div>

<p>
Detach them:
</p>
<div class="org-src-container">
<pre class="src src-sh">vale-test detach 8 1
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org7ae938f" class="outline-2">
<h2 id="org7ae938f">Netmap App Programming</h2>
<div class="outline-text-2" id="text-org7ae938f">
</div>
<div id="outline-container-org669a263" class="outline-3">
<h3 id="org669a263">Netmap APIs</h3>
</div>

<div id="outline-container-org1caa3ba" class="outline-3">
<h3 id="org1caa3ba">Sample: Nmpingd</h3>
</div>
</div>
</div>
</body>
</html>
